var russian_language = {
  "table_1":[
             "table", // id
             ["Типы речи", "Стили речи"], // tr - th
             [ // tr 1
              [["list", ["1: Повествование", "2: Описание", "3: Рассуждение"]]],  // td
              [["list", ["1: Разговорный", "2: Книжный"]]] // td
             ] // tr 1
            ],
  "table_2":[
             "table", // id
             ["1. Тире между подлежащим и сказуемым ставится", "Примеры:"], // tr - th
             [ // tr 1
              [["p", ["span", "На месте отсутствующего глагола-связки, если подлежащиее и сказуемое выражены "], ["strong", "именем существительным в форме И.п"]]], // td
              [["p", ["span", "Земля - планета. Москва - столица России."]]] // td
             ], // tr 1
             [ // tr 2
              [["p", ["span", "2. Если подлежащее и сказуемое выражены "], ["strong", "инфинитивом"], ["span", "."]]], // td
              [["p", ["span", "Без дела жить - только себе коптить."]]] // td
             ] // tr 2
            ],
  "paragraph_1":["p", "Очерк", "небольшое литературное произведение, краткое описание жизненных событий (обычно социально значимых). Очерки бывают документальные, публицистические, бытовые.",],
  "paragraph_2":["p", "Интервью", "жанр публицистики, представляющий собой беседу журналиста с одним или несколькими лицами по вопросам, имеющим актуальное значение."],
  "paragraph_3":["p", "Научный стиль", "употребляется  в сфере науки, образования, производства в письменной и устной речи."],
  "list_1":["list", "Подстили:", ["1: Собственно научный - доказать обретённую научную истинну.", "2: Научно-учебный - сообщить об уже известных научных истинах.", "3: Научно-популярный - доступно изложить научные идеи, открытия и т.д."]],
  "paragraph_4":["p", "Согласование", "это такой вид подчинительной связи, при котором зависимое слово ставится в той же форме, что и главное т.е согласуется с главным словом в роде, числе и падеже или в числе и падеже. При согласовании с изменением форма главного слова соответственно изменяется и форма зависимого слова.",],
  "paragraph_5":["p", "Управление", "это такой вид подчинительной связи, при котором зависимое слово ставится при главном слове в определённом палеже независимо от того в какой форме стоит глвное (косвенные падежи). При управлении с изменением формы главного слова зависимое слово не изменяется (остаётся в том же падеже)."],
  "paragraph_6":["p", "Примыкание", "это такой вид подчинительной связи, при котором в роли зависимого слова выступает неизменяемые слова: наречия, деепричастия, неопределённая форма глагола и прятежательные местоимения его, её, их. В словосочетании со связью приымыкание зависимое неизменяемое слово соединяется с главным только по смыслу."]
}

/*<p><table border="1px" width="100%">
   <tr>
    <th>Тире между подлежащим и сказуемым ставится</th>
    <th>Пример</th>
   </tr>
   <tr>
    <td>1. На месте отсутствующего глагола-связки, если подлежащее и сказуемое выражены<strong> именем существительным в форме И.п</strong></td>
    <td>Земля - планета. Москва - столица России.</td>
   </tr>
   <tr>
    <td>2. Если подлежащее и сказуемое выражены <strong>инфинитивом</strong>.</td>
    <td>Без дела жить - только себе коптить.</td>
   </tr>
   <tr>
    <td>3. Если один из главных членов выражен <strong>инфинитивом</strong>, а другой - <strong>именем существительным в форме И.п</strong>.</td>
    <td>Быть, а не казаться - девиз, который должен носить в своём сердце каждый гражданин.</td>
   </tr>
   <tr>
    <td>4. Если перед сказуемым,  выраженным инфинитивом или именем существительным, стоят слова <strong>это, это есть, это значит, вот</strong>.</td>
    <td>Кремль - это центральная часть древнерусских городов.</td>
   </tr>
   <tr>
    <td>Если оба главных члена предложения выражены <strong>количественным числительным</strong> или если один из низ выражен <strong>именем существительным в И. п</strong>, а другой - <strong>именем числительным</strong> или <strong>оборотом с числительным</atrong>.</td>
    <td>Трижды пять - пятнадцать. Сила ветра - пять метров в секунду.</td>
   </tr>
  </table></p>*/