var russian_language = {
  "table_1":[
             "table",
             ["Типы речи", "Стили речи"],
             [
              [
               [["list", ["1. Повествование",  "2. Описание", "3. Рассуждение"]]],
               [["list", ["1. Разговорный", "2. Книжный (научный, публицистический, художественный, официально-деловой)"]]]
              ]
             ]
            ],
  "table_2":[
             "table",
             ["Тире между подлежащим и сказуемым ставится, если...", "Примеры:"],
             [
              [
               [["span", [["span", "1. На месте отсутствующего глагола-связки, если подлежащее и сказуемое выражены "], ["strong", "именем существительным в форме И.п"], ["span", "."]]]],
               [["list", ["Земля - планета.", "Москва - столица России."]]]
              ],
              [
               [["span", [["span", "2. Если подлежащее и сказуемое выражены "], ["strong", "инфинитивом"], ["span", "."]]]],
               [["list", ["Без дела жить - только себе коптить."]]]
              ],
              [
               [["span", [["span", "3. Если один из главных членов выражен "], ["strong", "инфинитивом"], ["span", ", а другой - "], ["strong", "именем существительным в форме И.п"], ["span", "."]]]],
               [["list", ["Быть, а не казаться - девиз, который должен носить в своём сердце каждый гражданин."]]]
              ],
             ]
            ],
  "paragraph_1":["p", "Очерк", "небольшое литературное произведение, краткое описание жизненных событий (обычно социально значимых). Очерки бывают документальные, публицистические, бытовые.",],
  "paragraph_2":["p", "Интервью", "жанр публицистики, представляющий собой беседу журналиста с одним или несколькими лицами по вопросам, имеющим актуальное значение."],
  "paragraph_3":["p", "Научный стиль", "употребляется  в сфере науки, образования, производства в письменной и устной речи."],
  "list_1":["list", "Подстили:", ["1: Собственно научный - доказать обретённую научную истинну.", "2: Научно-учебный - сообщить об уже известных научных истинах.", "3: Научно-популярный - доступно изложить научные идеи, открытия и т.д."]],
  "paragraph_4":["p", "Согласование", "это такой вид подчинительной связи, при котором зависимое слово ставится в той же форме, что и главное т.е согласуется с главным словом в роде, числе и падеже или в числе и падеже. При согласовании с изменением форма главного слова соответственно изменяется и форма зависимого слова.",],
  "paragraph_5":["p", "Управление", "это такой вид подчинительной связи, при котором зависимое слово ставится при главном слове в определённом палеже независимо от того в какой форме стоит глвное (косвенные падежи). При управлении с изменением формы главного слова зависимое слово не изменяется (остаётся в том же падеже)."],
  "paragraph_6":["p", "Примыкание", "это такой вид подчинительной связи, при котором в роли зависимого слова выступает неизменяемые слова: наречия, деепричастия, неопределённая форма глагола и прятежательные местоимения его, её, их. В словосочетании со связью приымыкание зависимое неизменяемое слово соединяется с главным только по смыслу."]
}

var mathematics = {

}
